export interface ValueData {
  id: string;
  name: string;
  selectedFeelings: string[];
  feelingNotes: Record<string, string>; // ملاحظات لكل شعور
  notes: string;
  balancePercentage: number;
}

export const FEELINGS = [
  "العار",
  "الذنب",
  "اليأس",
  "الحزن",
  "الخوف",
  "الاحتياج",
  "الغضب"
] as const;

export const VALUES = [
  "القوة",
  "المتانة",
  "الحكمة",
  "العزة",
  "القهارية",
  "الهيمنة",
  "العظمة",
  "القدر",
  "البراءة",
  "الصمدية",
  "السلام",
  "التعالي",
  "الرحيمية",
  "الغنى",
  "المغفرة",
  "الحمد",
  "اللطف",
  "الأولية",
  "الكِبر",
  "التكبر",
  "الكرامة",
  "الظهور",
  "الولاية",
  "الرحمانية",
  "الواحدية",
  "الرزق",
  "الخبرة",
  "الخلق",
  "الغفارية",
  "التصور",
  "الفتح",
  "القداسة",
  "العلو",
  "التبيين",
  "الملك",
  "البر",
  "القيومية",
  "الجبر",
  "التوبة",
  "الآخرية",
  "السمع",
  "الوهابية",
  "البطون",
  "البصر",
  "الود",
  "الأمن",
  "الحياة",
  "العلم",
  "الخلاقية"
] as const;
